---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.StairsAttrMinimumTreadDepth
source: html/41eef2d1-c19b-ebbf-63a0-962d3de6dbc3.htm
---
# Autodesk.Revit.DB.ParameterTypeId.StairsAttrMinimumTreadDepth Property

"Minimum Tread Depth"

## Syntax (C#)
```csharp
public static ForgeTypeId StairsAttrMinimumTreadDepth { get; }
```